user/doom/config/doom.org
** Org Roam
#+begin_src emacs-lisp :tangle config.el

(setq org-roam-directory "~/Documents/org/roam")

(setq org-roam-node-display-template
      "${title:65}📝${tags:*}")

(setq org-roam-list-files-commands '(rg find)) ;; command for search org-roam files
(use-package! consult-org-roam
   :ensure t
   :after org-roam
   :init
   (require 'consult-org-roam)
   ;; Activate the minor mode
   (consult-org-roam-mode 1)
   :custom
   ;; Use `ripgrep' for searching with `consult-org-roam-search'
   (consult-org-roam-grep-func #'consult-ripgrep)
   ;; Configure a custom narrow key for `consult-buffer'
   (consult-org-roam-buffer-narrow-key ?r)
   ;; Display org-roam buffers right after non-org-roam buffers
   ;; in consult-buffer (and not down at the bottom)
   (consult-org-roam-buffer-after-buffers t)
   :config
   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key "M-.")
   :bind
   ;; Define some convenient keybindings as an addition
   ("C-c n e" . consult-org-roam-file-find)
   ("C-c n b" . consult-org-roam-backlinks)
   ("C-c n B" . consult-org-roam-backlinks-recursive)
   ("C-c n l" . consult-org-roam-forward-links)
   ("C-c n r" . consult-org-roam-search))
#+end_src

** Org presentation
This configuration for setup org mode to use it as presentation tool

#+begin_src emacs-lisp :tangle config.el

(defun config/presentation-start ()
  (setq text-scale-mode-amount 3)
  (setq olivetti-body-width 60)
  (read-only-mode)
  (openwith-mode 0 )
  (text-scale-mode 1))


(defun config/presentation-end ()
  (setq olivetti-body-width 120)
  (setq header-line-format nil)
  (read-only-mode)
  (openwith-mode 1 )
  (text-scale-mode 0))

(use-package! org-tree-slide
  :hook ((org-tree-slide-play . config/presentation-start)
         (org-tree-slide-stop . config/presentation-end))
  :custom
  (org-image-actual-width nil))
#+end_src

** Git
*** Magit
#+begin_src emacs-lisp :tangle config.el
#+end_src
*** Git Timemachine
#+begin_src emacs-lisp :tangle config.el
#+end_src

** Dired
#+begin_src emacs-lisp :tangle config.el

(use-package! nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))

(require 'dired-x)
(setq dired-omit-files 
        (concat dired-omit-files "\\|^\\..*"))

#+end_src

** Complition
#+begin_src emacs-lisp :tangle config.el

(use-package nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

#+end_src

** Ibuffer
#+begin_src emacs-lisp :tangle config.el
(use-package! nerd-icons-ibuffer
  :ensure t
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(setq ibuffer-saved-filter-groups
      '(("default"
         ("Programming"   (predicate . (derived-mode-p 'prog-mode)))
         ("Org"           (mode . org-mode))
         ("Dired"         (mode . dired-mode))
         ("Magit"         (name . "^magit")))))

;; Exclude some buffers
(setq ibuffer-never-show-predicates
      '(;; System buffers
        "^\\*Messages\\*$"
        "^\\*scratch\\*$"
        "^\\*Completions\\*$"
        "^\\*Help\\*$"
        "^\\*Apropos\\*$"
        "^\\*info\\*$"
        "^\\*Async-native-compile-log\\*$"
        "^\\*Native-compile-log\\*$"

        ;; LSP Buffers
        "^\\*lsp-log\\*$"
        "^\\*clojure-lsp\\*$"
        "^\\*clojure-lsp::stderr\\*$"
        "^\\*ts-ls\\*$"
        "^\\*ts-ls::stderr\\*$"))

(setq ibuffer-formats
      '((mark " " (name 60 -1 :left))))

#+end_src

** awqat
#+begin_src emacs-lisp :tangle config.el

(use-package! awqat
  :commands (awqat-display-prayer-time-mode
             awqat-times-for-day)
  :config
  (setq calendar-latitude 32.377533
        calendar-longitude 15.092017
        awqat-mode-line-format " ${prayer} (${hours}h${minutes}m) "
        awqat-prayer-safety-offsets '(1.0 -1.0 4.0 0.0 4.0 1.0))
  (awqat-set-preset-umm-al-qura))

#+end_src

** Olivetti
#+begin_src emacs-lisp :tangle config.el
(use-package! olivetti
  :defer t
  :config
  (setq olivetti-style t))

(map! :leader
      :prefix "t"
      :desc "Toggle center content" "O" #'olivetti-mode)
#+end_src

** Emms
Emacs MultiMedia System

#+begin_src emacs-lisp :tangle config.el

(use-package! emms
  :bind
  (("<AudioPlay>" . emms-start)
   ("<AudioPause>" . emms-pause)))

#+end_src

** Typst

#+begin_src emacs-lisp :tangle config.el

(use-package! typst-ts-mode
  :custom
  (typst-ts-watch-options "--open")
  (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory))
  (typst-ts-mode-enable-raw-blocks-highlight t)
  :config
  (keymap-set typst-ts-mode-map "C-c C-c" #'typst-ts-tmenu)
  (add-to-list 'auto-mode-alist '("\.typ\'" . typst-ts-mode)))


(use-package! ox-typst
  :after org)

(use-package! lsp-mode  
  :config  
  ;; Register the language ID for your major mode  
  (add-to-list 'lsp-language-id-configuration '(typst-ts-mode . "tinymist"))  
    
  ;; Register the tinymist client  
  (lsp-register-client  
   (make-lsp-client  
    :new-connection (lsp-stdio-connection "tinymist")  
    :activation-fn (lsp-activate-on "tinymist")  
    :server-id 'tinymist)))

(add-hook! 'typst-ts-mode-hook #'lsp!)
#+end_src

** OpenWith

#+begin_src emacs-lisp :tangle config.el

(use-package! openwith
  :config
  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("mp3" "mp4"))
               "mpv"
               '(file))
         
         (list (openwith-make-extension-regexp
                '("png" "jpeg" "jpg" "gif"))
               "imv"
               '(file))
         
         (list (openwith-make-extension-regexp
                '("pdf"))
               "zathura"
               '(file))
         (list (openwith-make-extension-regexp
                '("pptx"))
               "firefox"
               '(file))

         ))
  (openwith-mode nil))

#+end_src

** LSP
#+begin_src emacs-lisp :tangle config.el
(setq lsp-rust-analyzer-linked-projects ["Cargo.toml"])
#+end_src

** Ox-reveal
#+begin_src emacs-lisp :tangle config.el
(use-package! ox-reveal)
(setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
#+end_src

* My package.el
This file contains the declare of all package that we want to install

To install package use the doom macro =package!=
=ex=: (package! org-modren)

=NOTE=: after you edit this file make sure you run =doom sync= or =SPC h r r=

For more info for packaging in doom read =Package management= in doom doc

#+begin_src emacs-lisp :tangle packages.el
;; Org
(package! org-pomodoro)
(package! org-modern)
(package! org-tree-slide)
(package! org-auto-tangle)
(package! org-super-agenda)
(package! consult-org-roam)
(package! svg-tag-mode)
(package! ox-typst)

;; Icons
(package! nerd-icons)
(package! nerd-icons-dired)
(package! nerd-icons-completion)
(package! nerd-icons-ibuffer)
(package! all-the-icons)

;; UI
(package! rainbow-delimiters)
(package! olivetti)
(package! imenu-list)
(package! focus)

;; Utilities
(package! openwith)

;; light theme
(package! south-theme
  :recipe (:host github
           :repo "SophieBosio/south"))


(package! awqat
  :recipe (:host github
           :repo "zkry/awqat"))

;; Typst
(package! typst-ts-mode
  :recipe (:host nil
           :repo "https://git.sr.ht/~meow_king/typst-ts-mode"))
(package! ox-typst)

(package! ox-reveal)
(package! tmr)

(package! gt)
(package! ssh-agency)
(package! bluetooth)
#+end_src

