user/doom/config/config.el

(setq org-roam-directory "~/Documents/org/roam")

(setq org-roam-node-display-template
      "${title:65}📝${tags:*}")

(setq org-roam-list-files-commands '(rg find)) ;; command for search org-roam files
(use-package! consult-org-roam
   :ensure t
   :after org-roam
   :init
   (require 'consult-org-roam)
   ;; Activate the minor mode
   (consult-org-roam-mode 1)
   :custom
   ;; Use `ripgrep' for searching with `consult-org-roam-search'
   (consult-org-roam-grep-func #'consult-ripgrep)
   ;; Configure a custom narrow key for `consult-buffer'
   (consult-org-roam-buffer-narrow-key ?r)
   ;; Display org-roam buffers right after non-org-roam buffers
   ;; in consult-buffer (and not down at the bottom)
   (consult-org-roam-buffer-after-buffers t)
   :config
   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key "M-.")
   :bind
   ;; Define some convenient keybindings as an addition
   ("C-c n e" . consult-org-roam-file-find)
   ("C-c n b" . consult-org-roam-backlinks)
   ("C-c n B" . consult-org-roam-backlinks-recursive)
   ("C-c n l" . consult-org-roam-forward-links)
   ("C-c n r" . consult-org-roam-search))

(defun config/presentation-start ()
  (setq text-scale-mode-amount 3)
  (setq olivetti-body-width 60)
  (read-only-mode)
  (openwith-mode 0 )
  (text-scale-mode 1))


(defun config/presentation-end ()
  (setq olivetti-body-width 120)
  (setq header-line-format nil)
  (read-only-mode)
  (openwith-mode 1 )
  (text-scale-mode 0))

(use-package! org-tree-slide
  :hook ((org-tree-slide-play . config/presentation-start)
         (org-tree-slide-stop . config/presentation-end))
  :custom
  (org-image-actual-width nil))





(use-package! nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))

(require 'dired-x)
(setq dired-omit-files 
        (concat dired-omit-files "\\|^\\..*"))

(use-package nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package! nerd-icons-ibuffer
  :ensure t
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(setq ibuffer-saved-filter-groups
      '(("default"
         ("Programming"   (predicate . (derived-mode-p 'prog-mode)))
         ("Org"           (mode . org-mode))
         ("Dired"         (mode . dired-mode))
         ("Magit"         (name . "^magit")))))

;; Exclude some buffers
(setq ibuffer-never-show-predicates
      '(;; System buffers
        "^\\*Messages\\*$"
        "^\\*scratch\\*$"
        "^\\*Completions\\*$"
        "^\\*Help\\*$"
        "^\\*Apropos\\*$"
        "^\\*info\\*$"
        "^\\*Async-native-compile-log\\*$"
        "^\\*Native-compile-log\\*$"

        ;; LSP Buffers
        "^\\*lsp-log\\*$"
        "^\\*clojure-lsp\\*$"
        "^\\*clojure-lsp::stderr\\*$"
        "^\\*ts-ls\\*$"
        "^\\*ts-ls::stderr\\*$"))

(setq ibuffer-formats
      '((mark " " (name 60 -1 :left))))

(use-package! awqat
  :commands (awqat-display-prayer-time-mode
             awqat-times-for-day)
  :config
  (setq calendar-latitude 32.377533
        calendar-longitude 15.092017
        awqat-mode-line-format " ${prayer} (${hours}h${minutes}m) "
        awqat-prayer-safety-offsets '(1.0 -1.0 4.0 0.0 4.0 1.0))
  (awqat-set-preset-umm-al-qura))

(use-package! olivetti
  :defer t
  :config
  (setq olivetti-style t))

(map! :leader
      :prefix "t"
      :desc "Toggle center content" "O" #'olivetti-mode)

(use-package! emms
  :bind
  (("<AudioPlay>" . emms-start)
   ("<AudioPause>" . emms-pause)))

(use-package! typst-ts-mode
  :custom
  (typst-ts-watch-options "--open")
  (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory))
  (typst-ts-mode-enable-raw-blocks-highlight t)
  :config
  (keymap-set typst-ts-mode-map "C-c C-c" #'typst-ts-tmenu)
  (add-to-list 'auto-mode-alist '("\.typ\'" . typst-ts-mode)))


(use-package! ox-typst
  :after org)

(use-package! lsp-mode  
  :config  
  ;; Register the language ID for your major mode  
  (add-to-list 'lsp-language-id-configuration '(typst-ts-mode . "tinymist"))  
    
  ;; Register the tinymist client  
  (lsp-register-client  
   (make-lsp-client  
    :new-connection (lsp-stdio-connection "tinymist")  
    :activation-fn (lsp-activate-on "tinymist")  
    :server-id 'tinymist)))

(add-hook! 'typst-ts-mode-hook #'lsp!)

(use-package! openwith
  :config
  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("mp3" "mp4"))
               "mpv"
               '(file))
         
         (list (openwith-make-extension-regexp
                '("png" "jpeg" "jpg" "gif"))
               "imv"
               '(file))
         
         (list (openwith-make-extension-regexp
                '("pdf"))
               "zathura"
               '(file))
         (list (openwith-make-extension-regexp
                '("pptx"))
               "firefox"
               '(file))

         ))
  (openwith-mode nil))

(setq lsp-rust-analyzer-linked-projects ["Cargo.toml"])

(use-package! ox-reveal)
(setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
